{
  "additional_special_tokens": [
    {
      "content": "<image_placeholder>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false
    }
  ],
  "bos_token": "<｜begin▁of▁sentence｜>",
  "eos_token": "<｜end▁of▁sentence｜>"
}
